In [12]:
import pandas as pd

In [13]:
data = {
    "OrderID": [1, 2, 3, 4, 5, 6, 7, 8],
    "Product": ["Laptop", "Laptop", "Phone", "Phone", "Tablet", "Tablet", "Laptop", "Phone"],
    "Category": ["Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics"],
    "Quantity": [1, 2, 1, 3, 2, 1, 1, 2],
    "Price": [1000, 1200, 800, 750, 400, 450, 1100, 850],
    "Total_Sales": [1000, 2400, 800, 2250, 800, 450, 1100, 1700],
    "Date": pd.to_datetime(["2024-02-01", "2024-02-01", "2024-02-02", "2024-02-03", "2024-02-04", "2024-02-04", "2024-02-05", "2024-02-05"]),
    "Region": ["Cairo", "Alex", "Cairo", "Alex", "Cairo", "Cairo", "Alex", "Alex"]
}

In [14]:
df = pd.DataFrame(data)
df

,OrderID,Product,Category,Quantity,Price,Total_Sales,Date,Region
0,1,Laptop,Electronics,1,1000,1000,2024-02-01,Cairo
1,2,Laptop,Electronics,2,1200,2400,2024-02-01,Alex
2,3,Phone,Electronics,1,800,800,2024-02-02,Cairo
3,4,Phone,Electronics,3,750,2250,2024-02-03,Alex
4,5,Tablet,Electronics,2,400,800,2024-02-04,Cairo
5,6,Tablet,Electronics,1,450,450,2024-02-04,Cairo
6,7,Laptop,Electronics,1,1100,1100,2024-02-05,Alex
7,8,Phone,Electronics,2,850,1700,2024-02-05,Alex

In [15]:
df["year"]=df["Date"].dt.year

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   OrderID      8 non-null      int64
 1   Product      8 non-null      object
 2   Category     8 non-null      object
 3   Quantity     8 non-null      int64
 4   Price        8 non-null      int64
 5   Total_Sales  8 non-null      int64
 6   Date         8 non-null      datetime64[ns]
 7   Region       8 non-null      object
 8   year         8 non-null      int64
dtypes: datetime64[ns](1), int64(5), object(3)
memory usage: 704.0+ bytes

In [17]:
df.head()

,OrderID,Product,Category,Quantity,Price,Total_Sales,Date,Region,year
0,1,Laptop,Electronics,1,1000,1000,2024-02-01,Cairo,2024
1,2,Laptop,Electronics,2,1200,2400,2024-02-01,Alex,2024
2,3,Phone,Electronics,1,800,800,2024-02-02,Cairo,2024
3,4,Phone,Electronics,3,750,2250,2024-02-03,Alex,2024
4,5,Tablet,Electronics,2,400,800,2024-02-04,Cairo,2024

# Total Sales by Product

In [18]:
df_grouped = df.groupby("Product")["Total_Sales"].sum().reset_index()
print(df_grouped)
# Identify which product generates the highest total sales.

  Product  Total_Sales
0  Laptop         4500
1   Phone         4750
2  Tablet         1250

 # Number of Orders per Product

In [19]:
df_grouped = df.groupby("Product")["OrderID"].count().reset_index().rename(columns={"OrderID":"Order Count"})
print(df_grouped)
#Find out the most frequently ordered products

  Product  Order Count
0  Laptop            3
1   Phone            3
2  Tablet            2

 # Total Sales by Region

In [20]:
df_grouped = df.groupby("Region")["Total_Sales"].sum().reset_index()
df_grouped
#Identify the most profitable regions.

  Region  Total_Sales
0   Alex         7450
1  Cairo         3050

#  Total Sales by Date

In [21]:
df_grouped = df.groupby(df["Date"])["Total_Sales"].sum().reset_index()
df_grouped
#Analyze daily sales trends/

        Date  Total_Sales
0 2024-02-01         3400
1 2024-02-02          800
2 2024-02-03         2250
3 2024-02-04         1250
4 2024-02-05         2800

 # Total Sales by Product and Region

In [22]:
df_grouped = df.groupby(["Product", "Region"])["Total_Sales"].sum().reset_index()
df_grouped

  Product Region  Total_Sales
0  Laptop   Alex         3500
1  Laptop  Cairo         1000
2   Phone   Alex         3950
3   Phone  Cairo          800
4  Tablet  Cairo         1250

# Total Quantity Sold per Product

In [23]:
df_grouped = df.groupby("Product")["Quantity"].sum().reset_index()
print(df_grouped)
#Identify which products have the highest number of units sold

  Product  Quantity
0  Laptop         4
1   Phone         6
2  Tablet         3

In [24]:
# Creating an inconsistent DataFrame
data = {
    "OrderID": [1, 2, 3, 4, 5, 6, 7, 8],
    "Product": ["Laptop", "Laptop", "Phone", "Phone  ", "  Tablet", "Tablet", "laptop", "Phone"],
    "Category": ["Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics"],
    "Quantity": [1, 2, 1, 3, 2, 1, -1, 2],
}

df = pd.DataFrame(data)
df

   OrderID   Product     Category  Quantity
0        1    Laptop  Electronics         1
1        2    Laptop  Electronics         2
2        3     Phone  Electronics         1
3        4   Phone    Electronics         3
4        5    Tablet  Electronics         2
5        6    Tablet  Electronics         1
6        7    laptop  Electronics        -1
7        8     Phone  Electronics         2

In [25]:
df["Product"].unique()

array(['Laptop', 'Phone', 'Phone  ', '  Tablet', 'Tablet', 'laptop'],
      dtype=object)

In [28]:
df["Product"]=df["Product"].str.lower().str.strip()
df["Product"].unique()

array(['laptop', 'phone', 'tablet'], dtype=object)

In [30]:
df

   OrderID Product     Category  Quantity
0        1  laptop  Electronics         1
1        2  laptop  Electronics         2
2        3   phone  Electronics         1
3        4   phone  Electronics         3
4        5  tablet  Electronics         2
5        6  tablet  Electronics         1
6        7  laptop  Electronics        -1
7        8   phone  Electronics         2

In [31]:
data = {
    "OrderID": [1, 2, 3, 4, 5, 6, 7, 8],
    "Product": ["Laptop", "Laptop", "Phone", "Phone", "Tablet", "Tablet", "Laptop", "Phone"],
    "Category": ["Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics", "Electronics"],
    "Quantity": [1, 2, 1, 3, 2, 1, 1, 2],
    "Price": [1000, 1200, 800, 750, 400, 450, 1100, 850],
    "Total_Sales": [1000, 2400, 800, 2250, 800, 450, 1100, 1700],
    "Date": pd.to_datetime(["2024-02-01", "2024-02-01", "2024-02-02", "2024-02-03", "2024-02-04", "2024-02-04", "2024-02-05", "2024-02-05"]),
    "Region": ["Cairo", "Alex", "Cairo", "Alex", "Cairo", "Cairo", "Alex", "Alex"]
}

In [33]:
df = pd.DataFrame(data)
df

,OrderID,Product,Category,Quantity,Price,Total_Sales,Date,Region
0,1,Laptop,Electronics,1,1000,1000,2024-02-01,Cairo
1,2,Laptop,Electronics,2,1200,2400,2024-02-01,Alex
2,3,Phone,Electronics,1,800,800,2024-02-02,Cairo
3,4,Phone,Electronics,3,750,2250,2024-02-03,Alex
4,5,Tablet,Electronics,2,400,800,2024-02-04,Cairo
5,6,Tablet,Electronics,1,450,450,2024-02-04,Cairo
6,7,Laptop,Electronics,1,1100,1100,2024-02-05,Alex
7,8,Phone,Electronics,2,850,1700,2024-02-05,Alex

In [34]:

df['Product'].fillna('Unknown', inplace=True)


df['Price'].fillna(df['Price'].mean(), inplace=True)


df['Quantity'] = df['Quantity'].apply(lambda x: max(x, 0))

print(df)

   OrderID Product     Category  Quantity  Price  Total_Sales       Date  \
0        1  Laptop  Electronics         1   1000         1000 2024-02-01
1        2  Laptop  Electronics         2   1200         2400 2024-02-01
2        3   Phone  Electronics         1    800          800 2024-02-02
3        4   Phone  Electronics         3    750         2250 2024-02-03
4        5  Tablet  Electronics         2    400          800 2024-02-04
5        6  Tablet  Electronics         1    450          450 2024-02-04
6        7  Laptop  Electronics         1   1100         1100 2024-02-05
7        8   Phone  Electronics         2    850         1700 2024-02-05

  Region
0  Cairo
1   Alex
2  Cairo
3   Alex
4  Cairo
5  Cairo
6   Alex
7   Alex